In [1]:
# import dependencies
import pathlib as path
import numpy as np
import pandas as pd

In [2]:
# 2022 csv into dataframe
df_2022 = pd.read_csv("Resources/labeled_cleaned_billionaire.csv")
df_2022.head()

,rank,personName,age,finalWorth,category,country,selfMade,gender
0,1,Elon Musk,50.0,219000,Automotive,United States,True,M
1,2,Jeff Bezos,58.0,171000,Technology,United States,True,M
2,3,Bernard Arnault & family,73.0,158000,Fashion & Retail,France,False,M
3,4,Bill Gates,66.0,129000,Technology,United States,True,M
4,5,Warren Buffett,91.0,118000,Finance & Investments,United States,True,M

In [3]:
# 2018 csv into dataframe
df_2018 = pd.read_csv("Resources/labeled_cleaned_2018_billionaire.csv")
df_2018.head()

,rank,personName,age,finalWorth,category,country,gender
0,1,Jeff Bezos,54.0,112000,Technology,United States,M
1,2,Bill Gates,62.0,90000,Technology,United States,M
2,3,Warren Buffett,87.0,84000,Finance & Investments,United States,M
3,4,Bernard Arnault,69.0,72000,Fashion & Retail,France,M
4,5,Mark Zuckerberg,33.0,71000,Technology,United States,M

In [4]:
df_2022.dtypes

rank            int64
personName     object
age           float64
finalWorth      int64
category       object
country        object
selfMade         bool
gender         object
dtype: object

In [5]:
df_2018.dtypes

rank            int64
personName     object
age           float64
finalWorth      int64
category       object
country        object
gender         object
dtype: object

In [6]:
# Convert age from float dtype to int
df_2022['age'] = df_2022['age'].astype(int)
df_2022

,rank,personName,age,finalWorth,category,country,selfMade,gender
0,1,Elon Musk,50,219000,Automotive,United States,True,M
1,2,Jeff Bezos,58,171000,Technology,United States,True,M
2,3,Bernard Arnault & family,73,158000,Fashion & Retail,France,False,M
3,4,Bill Gates,66,129000,Technology,United States,True,M
4,5,Warren Buffett,91,118000,Finance & Investments,United States,True,M
...,...,...,...,...,...,...,...,...
2571,2578,Zhang Yuqiang,66,1000,Manufacturing,China,True,M
2572,2578,Zhou Ruxin,59,1000,Technology,China,True,M
2573,2578,Wen Zhou & family,57,1000,Manufacturing,China,True,M
2574,2578,Zhou Yifeng & family,43,1000,Energy,China,True,F
2575,2578,Zhuang Kuilong & family,59,1000,Manufacturing,China,True,M

In [7]:
# Convert age from float dtype to int
df_2018['age'] = df_2018['age'].astype(int)
df_2018

,rank,personName,age,finalWorth,category,country,gender
0,1,Jeff Bezos,54,112000,Technology,United States,M
1,2,Bill Gates,62,90000,Technology,United States,M
2,3,Warren Buffett,87,84000,Finance & Investments,United States,M
3,4,Bernard Arnault,69,72000,Fashion & Retail,France,M
4,5,Mark Zuckerberg,33,71000,Technology,United States,M
...,...,...,...,...,...,...,...
2130,2124,Zhao Xiaoqiang,50,1000,Fashion & Retail,China,M
2131,2124,Zhou Liangzhang,55,1000,Manufacturing,China,M
2132,2124,Zhu Xingming,51,1000,Manufacturing,China,M
2133,2124,Zhuo Jun,52,1000,Manufacturing,Hong Kong,F
2134,2124,Olgun Zorlu,54,1000,Diversified,Turkey,M

In [8]:
df_2022.dtypes

rank           int64
personName    object
age            int32
finalWorth     int64
category      object
country       object
selfMade        bool
gender        object
dtype: object

In [9]:
df_2018.dtypes

rank           int64
personName    object
age            int32
finalWorth     int64
category      object
country       object
gender        object
dtype: object

In [10]:
#find sum duplicated personName values in df_2022
df_2022.personName.duplicated().sum()

2

In [11]:
#find sum duplicated personName values in df_2018
df_2018.personName.duplicated().sum()

2

In [12]:
# Get list of duplicate rows based on 'personName' column for df_2022
# Using sort values
duplicate2022 = df_2022[df_2022.personName.duplicated(keep=False)].sort_values("personName")
duplicate2022

,rank,personName,age,finalWorth,category,country,selfMade,gender
1147,1163,Li Li,56,2700,Healthcare,China,True,M
2060,2076,Li Li,58,1400,Healthcare,China,True,M
535,536,Wang Yanqing & family,55,5100,Manufacturing,China,True,M
1739,1729,Wang Yanqing & family,75,1700,Manufacturing,China,False,F

In [13]:
# Get list of duplicate rows based on 'personName' column for df_2018
# Using sort values
duplicate2018 = df_2018[df_2018.personName.duplicated(keep=False)].sort_values("personName")
duplicate2018

,rank,personName,age,finalWorth,category,country,gender
347,365,Jim Davis,74,5000,Manufacturing,United States,M
823,859,Jim Davis,57,2000,Service,United States,M
449,466,Robert Miller,84,4000,Fashion & Retail,United Kingdom,M
904,924,Robert Miller,72,2000,Technology,Canada,M

In [14]:
#pull value of row 1147 personName in df_2022
df_2022.at[1147,'personName']

'Li Li'

In [15]:
# update cell value with new personName
# Row 1147 for df_2022

df_2022.at[1147,'personName']= 'Li Li (Shenzhen Hepalink Pharmaceutical)'

df_2022.at[1147,'personName']

'Li Li (Shenzhen Hepalink Pharmaceutical)'

In [16]:
#pull value of row 2060 personName in df_2022
df_2022.at[2060,'personName']

'Li Li'

In [17]:
# update cell value with new personName
# Row 1147 for df_2022

df_2022.at[2060,'personName']= 'Li Li (Aier Eye Hospital Group)'

df_2022.at[2060,'personName']

'Li Li (Aier Eye Hospital Group)'

In [18]:
#pull value of row 535 personName in df_2022
df_2022.at[535,'personName']

'Wang Yanqing & family'

In [19]:
# update cell value with new personName
# Row 535 for df_2022

df_2022.at[535,'personName']= 'Wang Yanquing (Wuxi Lead Intelligent Equipment)'

df_2022.at[535,'personName']

'Wang Yanquing (Wuxi Lead Intelligent Equipment)'

In [20]:
#pull value of row 1739 personName in df_2022
df_2022.at[1739,'personName']

'Wang Yanqing & family'

In [21]:
# update cell value with new personName
# Row 1739 for df_2022

df_2022.at[1739,'personName']= 'Wang Yanquing (Weihai Guangwei Group)'

df_2022.at[1739,'personName']

'Wang Yanquing (Weihai Guangwei Group)'

In [22]:
#pull value of row 347 personName in df_2018
df_2018.at[347,'personName']

'Jim Davis'

In [23]:
# update cell value with new personName
# Row 347 for df_2018

df_2018.at[347,'personName']= 'Jim Davis & Family'

df_2018.at[347,'personName']

'Jim Davis & Family'

In [24]:
#pull value of row 823 personName in df_2018
df_2018.at[823,'personName']

'Jim Davis'

In [25]:
# no change to personName for row 83 of df_2018

In [26]:
#pull value of row 449 personName in df_2018
df_2018.at[449,'personName']

'Robert Miller'

In [27]:
# no change to personName for row 449 of df_2018

In [28]:
#pull value of row 904 personName in df_2018
df_2018.at[904,'personName']

'Robert Miller'

In [29]:
# update cell value with new personName
# Row 904 for df_2018

df_2018.at[904,'personName']= 'Robert G. Miller'

df_2018.at[904,'personName']

'Robert G. Miller'

In [30]:
# Get list of duplicate rows based on 'personName' column for df_2022
# check to see if duplicates no longer exist
duplicate2022_2 = df_2022[df_2022.personName.duplicated(keep=False)].sort_values("personName")
duplicate2022_2

Empty DataFrame
Columns: [rank, personName, age, finalWorth, category, country, selfMade, gender]
Index: []

In [31]:
# Get list of duplicate rows based on 'personName' column for df_2018
# check to see if duplicates no longer exist
duplicate2018_2 = df_2018[df_2018.personName.duplicated(keep=False)].sort_values("personName")
duplicate2018_2

Empty DataFrame
Columns: [rank, personName, age, finalWorth, category, country, gender]
Index: []

In [32]:
#create new csv files specifically for SQL

file_path = "Resources/labeled_sql_cleaned_2022_billionaire.csv"
df_2022.to_csv(file_path, index=False)

In [33]:
file_path = "Resources/labeled_sql_cleaned_2018_billionaire.csv"
df_2018.to_csv(file_path, index=False)